export const INFO_TITLE_1 = 'Добро пожаловать в мир Таро';
export const INFO_TITLE_2 = 'Откройте тайны своего будущего с помощью древних карт';
export const ERROR_MESSAGE = 'Упс, магия не завелась. Пожалуйста, попробуйте снова позже';

// Ключи AsyncStorage
export const PREDICTION_KEY = '@tarot_prediction';
export const TIMESTAMP_KEY = '@tarot_timestamp';

// Enum с поинтами:
export enum EURL {
  PREDICTION_DATA = '/cards',
}
export enum EText {
  MAIN_INFO = 'Информация',
  DESCRIPTION = 'Приложение "Триплет-расклад дня" предлагает ежедневный расклад из трёх карт Таро, помогая пользователям получить инсайты, советы или вдохновение на предстоящий день.',
  ABOUT = 'О приложении',
  ABOUT_INFO = 'Добро пожаловать в приложение для ежедневных раскладов Таро! Здесь вы можете получить ежедневный расклад из трёх карт (триплет), который поможет вам лучше понять текущую ситуацию, получить совет или вдохновение. Каждый расклад сопровождается подробной интерпретацией, чтобы вы могли глубже погрузиться в мир Таро. Если вам нравится приложение, и вы хотите поддержать его развитие, вы можете сделать пожертвование. Ваша поддержка помогает улучшать приложение и добавлять новые функции. Спасибо за вашу доброту и участие!',
  DONATE = 'Поддержать проект',
  DONATE_INFO = 'Если вам нравится приложение, и вы хотите поддержать его развитие, вы можете сделать пожертвование. Ваша поддержка помогает мне продолжать работу над приложением, добавлять новые функции и улучшать его для вас. Спасибо за вашу доброту и участие!',
}
